import Link from "next/link";
import React, { useRef } from "react";

type Rainbow =
  | "red"
  | "orange"
  | "yellow"
  | "green"
  | "blue"
  | "indigo"
  | "violet";

// This extends the React.ElementType to include an `as` prop
// meaning as props type can be "h1" | "div" | "span" | ReactElement, etc.. literally anything that react element type can be

type AsProp<C extends React.ElementType> = {
  as?: C;
};

// a h1 h2 h3 h4 h5 etc...

// This is the type for the props that should be omitted from the component props
// The first type parameter is the component type, the second is the props type
// The return type is the keys of the props that should be omitted
// example: if C is "h1" and P/props is {color: "red", as: "h1"} we would remove the "color and as props" from the h1 element type and replace it with the appropriate props
type PropsToOmit<C extends React.ElementType, P> = keyof (AsProp<C> & P);

type PolymorphicComponentProp<
  C extends React.ElementType,
  Props = {}
> = React.PropsWithChildren<Props & AsProp<C>> &
  Omit<React.ComponentPropsWithRef<C>, PropsToOmit<C, Props>>;

/**
 * This is the updated component props using PolymorphicComponentPropWithRef
 */
type TextProps<C extends React.ElementType> = PolymorphicComponentProp<
  C,
  { color?: Rainbow | "black" }
>;

/**
 * This is the type used in the type annotation for the component
 */
type TextComponent = <C extends React.ElementType = "span">(
  props: TextProps<C>
) => React.ReactElement | null;

export const Text: TextComponent = <C extends React.ElementType = "span">({
  as,
  color,
  children,
  ...props
}: TextProps<C>) => {
  const Component = as || "span";

  const style = color ? { style: { color } } : {};

  return (
    <Component {...style} {...props}>
      {children}
    </Component>
  );
};

export const Test = () => {
  return <Text>HELLO?s</Text>;
};

const Button = (props: React.ComponentPropsWithRef<"button">) => {
  return <button {...props} />;
};

//
//
//
// Code...
// ်
//
//
//
//
// Matrial Ui code...
// Chakra Ui code...
// Mantine Ui code...
//
//
//
// Code...
//
// Code...
//
// Code...
// Browser မှာက တော့ ဒီ output အနေနဲ့ထွက်လာပါလိမ့်မယ်
// Pic...
// So, What's next?

// > အိုးကောင်းရချင်လျှင် နာနာရိုက် 🗣
// ဒီ Basic Implementation နဲ့ပတ်သပ်ပြီးတော့ ပြသနာလေးတွေရှိတယ်
// ပထမတစ်ခုက `as` prop က ကိုယ်ထည့်ချင်တဲ့ဟာထည့်လို့ရနေတယ်
// Code...
// ဒီနေရာမှာ `as` = 'htet' ဆိုပြီးမှပေးထားတယ် တစ်ကယ်တန်း 'htet' ဆိုတဲ့ စကားလုံးဟာ html ရဲ့ valid tag တစ်ခုမဟုတ်ဘဲ ပေးလို့ရနေတယ်
// Browser မှာဆိုရင်
// Pic...
// ဒုတိယ တစ်ခုအနေနဲ့ဆို မိမိစိတ်ကြောက် attributeကို ထည့်လို့ရနေတယ်
// ဥပမာ:
// Code...
// Component ရဲ့ `as` props ဟာ span ဖြစ်ပြီးတော့ href attribute ကို ထည့် လို့ရနေတယ်
// တတိယ တစ်ခုအနေနဲ့ဆို basic example မှာ as နဲ့ children ကလွဲပြီး အခြား props တွေထည့်လို့မရဘူး
// Code... passing the href attribute in PComponent.
// ဒါဆိုရင် ပြောစရာရှိတာက props တွေအားလုံး ကို spread လုပ်ပြီး ​ဖြေရှင်းလို့မရဘူးလား
// Code...
// ဒါဆိုရင် ခုနက code ကိုပြန်ကြည့်ရလိမ့်မယ်
// Code...
// တကယ်တန်း browser မှာ render လုပ်သွားတာ ပြန်ကြည့်အတဲ့အခါ
// Pic...
// A span with an href is invalid HTML.
// ဒါတွေက ဘာလို့မကောင်းတာလဲ?
// ပထမဆုံးအနေနဲ့ဆို Developer တွေအနေနဲ့ ဒီcomponent ကို သုံးရမှာ ကောင်းမွန်တဲ့ experience မရနိုင်ဘူး
// ၂. Type safety မရှိသလို bugs တွေ ဖြစ်ဖို့များတယ်
// ကျွန်တော်တို့ ဒါတွေကို ဘယ်လိုဖြေရှင်းကြမလဲ?
// အဖြေကတော့ Typescript ပါဘဲ
// ဒီနေရာမှာ Typescript ရဲ့အရေးပါပုံနဲ့ ဘယ်လောက်အသုံးဝင်ကြောင်းကျွန်တော်တိ​ု့တွေ့နိုင်ပါတယ်
// Typescript အားကိုးဖြင့် polymorphic component 💪
// ဒီ blog post ရဲ့ အပေါ်ဆုံးမှာ သိသင့်သိထားရမည့် အရာတွေကို ဖော်ပြထားပြီးဖြစ်တဲ့အတွက် မိတ်ဆွေအနေနဲ့ အနည်းဆုံး basic လောက်တော့သိထားပြီးသားဖြစ်ပြီလို့ ယူဆပါတယ်
// မသိသေးရင်တော့ basic လောက်ကို အရင်လေ့လာဖို့အတွက်အကြံပေးချင်ပါတယ် ။
// Okay Let's get Started!
// ကျွန်တော်တို့ ပထမဆုံးဖြေရှင်းသွားမယ့် ပြသနာနှစ်ခုက
// ၁. `as` prop က HTML element က လဲဲပြီးကျန်တာလက်မခံသင့်ဘူး
// ၂. Element နဲ့မကိုက် ညီတဲ့ attribute တွေကို ထည့်လို့မရသင့်ဘူး
// ## ၁. `as` prop မှာ HTML valid element passလို့ရအောင် ပြုလုပ်ခြင်း
// ကျွန်တော်တို့ လက်ရှိ code လေးကိုပြန်ကြည့်ရအောင်
// Code...
// Typescript genric နဲ့ရင်းနီးပြီးသားဖြစ်တဲ့သူတွေကတော့ ဒီနေရာမှာ genric သုံးသင့်တယ်ဆိုတာ ခန့်မှန်းမိမှာပါ
// Typescript ရဲ့ genric က user ပေးတဲ့ input type ပေါ်မူတည်ပြီး အလိုက်အလျောက် adapt လုပ်နိုင်ပါတယ်
// Code Implementation ကိုကြည့်လိုက်ရအောင်:
// Code...
// ဒီအတိုင်းလုပ်ကြည့်တဲ့အခါမှာ Typescript က အနီလိုင်းတစ်ပုံကြီးနဲ့ error ဆိုပြီး ကုန်းအော်ပါလိမ့်မယ်
// Pic...
// ဖြစ်ရတဲ့အကြောင်းအရင်းက Typescript ရဲ့ arrow function တွေနဲ့ ပတ်သပ်တဲ့ အားနည်းချက်ကြောင့်ပါ
// ပိုမိုလေ့လာရန်...
// ဒါကို ဖြေရှင်းဖို့ အတွက် နည်းလမ်းနှစ်ခုရှိပါတယ်
// ၁. genric type အရှေ့မှာ comma ထည့်ပြီးဖြေရှင်းလို့ရမယ်

// Code...
// ၂. genric types တွေကို limit ပြီးဖြေရှင်းမယ်
// Code...
// > ဒုတိယ solution ဟာ ကျွန်တော်တို့လိုချင်တဲ့ typeနဲ့ အနီးစပ်ဆုံးဖြစ်လို့ နောက်လာမယ့် code တွေမှာ ဒုတိယတစ်ခုကို အသုံးပြုသွားမှာဖြစ်တယ်
// လက်ရှိ solution ကြည့်တဲ့ အခါ `Component` ဆိုတဲ့ Element မှာ Typescript error လေးကိုတွေ့ရပါလိမ့်မယ်
// Pic...
// ဖြစ်ရတဲ့ အကြောင်းအရင်းက ကျွန်တော် တို့ define ထားတဲ့ as props ရဲ့ type ဟာ unknown type ဖြစ်ပြီး Typescript မှာ unknown type ဟာ react element အနေနဲ့ render လုပ်ခွင့်မရှိလို့ဖြစ်တယ်
// ဆိုတော့ ကျွန်တော်တို့ က genric မှာ unknown ဆိုပြီး extends လုပ်မယ့်အစား React.ElementType ဆိုပြီး extends လုပ်ကြမယ်
// Code...
// ဒါဆိုရင် ပထမပြသနာတစ်ခု ဖြေရှင်းပြီးသွားပြီ
// `as` prop မှာ html valid element ကလွဲ ပြီးကျန်တာထည့်ရင် Typescript က error ဆိုပြီးကုန်းအော်ပါလိမ့်မယ်
// Pic...

// Pic...

// So, What's next?

// နောက်ထပ်ဘာရှိအုံးမလဲဆို အခု component ဟာ react only အသုံးပြုပြီး create ထားတာဖြစ်ပြီး ကိုယ်တစ်ယောက်တည်းအတွက် ဘဲသုံးဖို့ဆို ဒီလောက်နဲ့လုံလောက်ပါတယ်
// ကျွန်တော်တို့က Type Safety ရှိပြီး reliable ဖြစ်တဲ့ component ကိုလိုချင်တာဆိုတော့ ဆက်သွားလိုက်ရအောင်

// > အိုးကောင်းရချင်လျှင် နာနာရိုက် 🗣

// ဒီ Basic Implementation နဲ့ပတ်သပ်ပြီးတော့ ပြသနာလေးတွေရှိတယ်

// ပထမတစ်ခုက `as` prop က ကိုယ်ထည့်ချင်တဲ့ဟာထည့်လို့ရနေတယ်

// Code...

// ဒီနေရာမှာ `as` = 'htet' ဆိုပြီးမှပေးထားတယ် တစ်ကယ်တန်း 'htet' ဆိုတဲ့ စကားလုံးဟာ html ရဲ့ valid tag တစ်ခုမဟုတ်ဘဲ ပေးလို့ရနေတယ်
// Browser မှာဆိုရင်

// Pic...

// ဒုတိယ တစ်ခုအနေနဲ့ဆို မိမိစိတ်ကြောက် attributeကို ထည့်လို့ရနေတယ်
// ဥပမာ:

// Code...

// Component ရဲ့ `as` props ဟာ span ဖြစ်ပြီးတော့ href attribute ကို ထည့် လို့ရနေတယ်

// တတိယ တစ်ခုအနေနဲ့ဆို basic example မှာ as နဲ့ children ကလွဲပြီး အခြား props တွေထည့်လို့မရဘူး

// Code... passing the href attribute in PComponent.

// ဒါဆိုရင် ပြောစရာရှိတာက props တွေအားလုံး ကို spread လုပ်ပြီး ​ဖြေရှင်းလို့မရဘူးလား

// Code...

// ဒါဆိုရင် ခုနက code ကိုပြန်ကြည့်ရလိမ့်မယ်

// Code...

// တကယ်တန်း browser မှာ render လုပ်သွားတာ ပြန်ကြည့်အတဲ့အခါ

// Pic...

// A span with an href is invalid HTML.

// ဒါတွေက ဘာလို့မကောင်းတာလဲ?
// ပထမဆုံးအနေနဲ့ဆို Developer တွေအနေနဲ့ ဒီcomponent ကို သုံးရမှာ ကောင်းမွန်တဲ့ experience မရနိုင်ဘူး
// ၂. Type safety မရှိသလို bugs တွေ ဖြစ်ဖို့များတယ်

// ကျွန်တော်တို့ ဒါတွေကို ဘယ်လိုဖြေရှင်းကြမလဲ?

// အဖြေကတော့ Typescript ပါဘဲ
// ဒီနေရာမှာ Typescript ရဲ့အရေးပါပုံနဲ့ ဘယ်လောက်အသုံးဝင်ကြောင်းကျွန်တော်တိ​ု့တွေ့နိုင်ပါတယ်

// Typescript အားကိုးဖြင့် polymorphic component 💪

// ဒီ blog post ရဲ့ အပေါ်ဆုံးမှာ သိသင့်သိထားရမည့် အရာတွေကို ဖော်ပြထားပြီးဖြစ်တဲ့အတွက် မိတ်ဆွေအနေနဲ့ အနည်းဆုံး basic လောက်တော့သိထားပြီးသားဖြစ်ပြီလို့ ယူဆပါတယ်
// မသိသေးရင်တော့ basic လောက်ကို အရင်လေ့လာဖို့အတွက်အကြံပေးချင်ပါတယ်။

// Okay Let's get Started!

// ကျွန်တော်တို့ ပထမဆုံးဖြေရှင်းသွားမယ့် ပြသနာနှစ်ခုက
// ၁. `as` prop က HTML element က လဲဲပြီးကျန်တာလက်မခံသင့်ဘူး
// ၂. Element နဲ့မကိုက် ညီတဲ့ attribute တွေကို ထည့်လို့မရသင့်ဘူး

// ## ၁. `as` prop မှာ HTML valid element passလို့ရအောင် ပြုလုပ်ခြင်း

// ကျွန်တော်တို့ လက်ရှိ code လေးကိုပြန်ကြည့်ရအောင်

// Code...

// Typescript genric နဲ့ရင်းနီးပြီးသားဖြစ်တဲ့သူတွေကတော့ ဒီနေရာမှာ genric သုံးသင့်တယ်ဆိုတာ ခန့်မှန်းမိမှာပါ
// Typescript ရဲ့ genric က user ပေးတဲ့ input type ပေါ်မူတည်ပြီး အလိုက်အလျောက် adapt လုပ်နိုင်ပါတယ်

// Code Implementation ကိုကြည့်လိုက်ရအောင်:

// Code...

// ဒီအတိုင်းလုပ်ကြည့်တဲ့အခါမှာ Typescript က အနီလိုင်းတစ်ပုံကြီးနဲ့ error ဆိုပြီး ကုန်းအော်ပါလိမ့်မယ်

// Pic...

// ဖြစ်ရတဲ့အကြောင်းအရင်းက Typescript ရဲ့ arrow function တွေနဲ့ ပတ်သပ်တဲ့ အားနည်းချက်ကြောင့်ပါ
// ပိုမိုလေ့လာရန်...

// ဒါကို ဖြေရှင်းဖို့ အတွက် နည်းလမ်းနှစ်ခုရှိပါတယ်

// ၁. genric type အရှေ့မှာ comma ထည့်ပြီးဖြေရှင်းလို့ရမယ်

// Code...

// ၂. genric types တွေကို limit ပြီးဖြေရှင်းမယ်

// Code...

// > ဒုတိယ solution ဟာ ကျွန်တော်တို့လိုချင်တဲ့ typeနဲ့ အနီးစပ်ဆုံးဖြစ်လို့ နောက်လာမယ့် code တွေမှာ ဒုတိယတစ်ခုကို အသုံးပြုသွားမှာဖြစ်တယ်

// လက်ရှိ solution ကြည့်တဲ့ အခါ `Component` ဆိုတဲ့ Element မှာ Typescript error လေးကိုတွေ့ရပါလိမ့်မယ်

// Pic...

// ဖြစ်ရတဲ့ အကြောင်းအရင်းက ကျွန်တော် တို့ define ထားတဲ့ as props ရဲ့ type ဟာ unknown type ဖြစ်ပြီး Typescript မှာ unknown type ဟာ react element အနေနဲ့ render လုပ်ခွင့်မရှိလို့ဖြစ်တယ်

// ဆိုတော့ ကျွန်တော်တို့ က genric မှာ unknown ဆိုပြီး extends လုပ်မယ့်အစား React.ElementType ဆိုပြီး extends လုပ်ကြမယ်

// Code...

// ဒါဆိုရင် ပထမပြသနာတစ်ခု ဖြေရှင်းပြီးသွားပြီ

// `as` prop မှာ html valid element ကလွဲ ပြီးကျန်တာထည့်ရင် Typescript က error ဆိုပြီးကုန်းအော်ပါလိမ့်မယ်

// Pic...

// Default type ဘယ်လိုထည့်မလဲ ကြည့်လိုက်ရအောင်

// Code...

// အဓိကက ဒီလိုင်းမှာပါ

// Code...

// ဒါဆိုရင် ခုနက သုံးထားတဲ့ Component ကိုပြန်ကြည့်ရင် Typescript အနေနဲ့ property href does not exist on type... ဆိုပြီး ပြနေပါလိမ့်မယ်

// Pic...
